Revit 2027 API
TaskDialog Methods
The TaskDialog type exposes the following members.
Methods
Name | Description
AddCommandLink(TaskDialogCommandLinkId, String) |  Adds a CommandLink associated to the given id, displaying the indicating main content.
AddCommandLink(TaskDialogCommandLinkId, String, String) |  Adds a CommandLink associated to the given id, displaying the indicating main and supporting content.
Dispose | Causes the object to release immediately any resources it may be utilizing.
(Inherited from APIObject)
EnableDoNotShowAgain |  Enables the "Do not show again" for a task dialog.
Equals | Determines whether the specified object is equal to the current object.
(Inherited from Object)
GetHashCode | Serves as the default hash function.
(Inherited from Object)
GetType | Gets the Type of the current instance.
(Inherited from Object)
Show() |  Shows the task dialog.
Show(String, String) |  Shows a task dialog with title, main instruction and a Close button.
Show(String, String, TaskDialogCommonButtons) |  Shows a task dialog with title, main instruction and common buttons.
Show(String, String, TaskDialogCommonButtons, TaskDialogResult) |  Shows a task dialog with title, main instruction, common buttons and default buttons.
ToString | Returns a string that represents the current object.
(Inherited from Object)
WasExtraCheckBoxChecked |  Gets the status of the extra checkbox.
WasVerificationChecked |  Gets the status of the verification checkbox.
Top
See Also
Reference
TaskDialog Class
Autodesk.Revit.UI Namespace